{
  "Biologically-inspired adaptive learning in the Hopfield-network based self-optimization model": [],
  "Flexible Attention-Based Multi-Policy Fusion for Efficient Deep Reinforcement Learning": [
    {
      "summary": {
        "value": "This paper defines the Knowledge-Grounded RL setting, a general RL setting for integrating knowledge (in the form of policies) into a policy to learn new tasks efficiently. Essentially this setting is similar to the MDP setting except that the agent is also given a set of knowledge policies to utilize. The paper also introduces a system/architecture within this KGRL setting, called Knowledge-Inclusive Attention Network (KIAN). The aim is to improve RL that is grounded on external knowledge policies. The paper outlines five desirable human-like properties they desire in their agents: knowledge-acquirable, sample-efficient, generalizable, compositional, and incremental. Moreover, they formally define these so that they are measurable within the KGRL setting (e.g., for evaluating algorithms on these dimensions).\n\nWhile previous methods typically intertwine knowledge representation and knowledge-fusion, thereby restricting their ability to adapt to numbers of policies, losing flexibility. KIAN is developed more flexibility, separating the knowledge representation and knowledge fusion.\n\nKIAN consists of three components: a policy that learns a strategy (similar to a normal policy) called the internal, embeddings that represent the given knowledge (or external) policies, a query that performs attentive action prediction to fuse the internal and external policies.\n\nKIAN also solves other issues that can occur in entropy-regularized KGRL. Entropy-regularized RL is common, but the authors show that in the KGRL setting issues can arise through entropy regularization where only a select few policies are selected, counterproductively reducing diversity in policy usage. The authors show that in the KGRL setting the agent will pay more attention to the policy with large entropy and in continuous control, will rely on the internal policy extensively. The paper introduces modifications so that this does not occur in KIAN.\n\nThe authors show results on both MiniGrid and robotics tasks and demonstrate sample efficiency, generalizability, as well as compositional and incremental learning.\n"
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The paper is mostly well-written and well-explained.\n\nThe method makes sense, and is a well-thought out architecture. \n\nI like how the authors address the entropy imbalance problem.\n\nI like that the authors define and quantify the behaviors they would like in the agent.\n\nThe results do seem to demonstrate their method is effective.\n"
      },
      "weaknesses": {
        "value": "While I think the experiments are good, with appropriate baselines and good environments to test the agent’s capabilities. I am concerned about statistical significance. In particular, only 5 seeds are run, and the performance benefit in many cases is minimal, which may quite possibly be attributed to randomness. While I do believe the method outperforms the baselines, I cannot say so with a lot of confidence to merit inclusion at NeurIPS. If the authors can run more seeds, especially given the large variance, it would dramatically improve their results.\n\n\nQualms:\nKGRL is consistently referred to as an RL framework, which it is, but the connotation can be misconstrued as being a framework “for” RL, implying it is a solution method for RL problems. I would recommend calling it a “setting” rather than a framework. Indeed, I was confused temporarily as a reader, especially when KGRL is stated as being “introduced” by this paper (as opposed to “described” or “outlined”). \n\n\nNits\nTypo Line 345: “border” should be: “broader”\n"
      },
      "questions": {
        "value": "In line 33, it is stated (for incremental): “Humans do not need to relearn how to navigate the entire knowledge set from scratch when they remove outdated strategies or add new ones”. Do humans truly “remove” outdated strategies?\n\nIn line 222, the paper states: “However, fusing multiple policies as equation (3) will make an agent biased toward a small set of knowledge policies when exploring the environment.” I am somewhat confused, equation (3) as is does not seem to have this issue. I thought this only occurs in the MaxEnt KGRL setting as introduced in the next section. Can the authors please clarify this?\n\nThe authors state the entropy imbalance problem is a property of the maximum entropy KGRL setting. I want to clarify that this is only shown for the specific case of policies in the form of equation (3), correct?\n\nHow could the policy embeddings/knowledge keys be learned?\n\nIs Gymnasium Robotics used for the experiments? Or the older OpenAI codebase?\n"
      },
      "limitations": {
        "value": "To me it is unclear how in more sophisticated settings how the knowledge keys (or policy embeddings) would be learned. This seems like a bottleneck to scalability that is not well-addressed."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "Humans can learn by aggregating external knowledge from others’ policies of attempting a task. While prior studies in RL have incorporated external knowledge policies for sample efficiency,  there still remains the generalization problem to be solved that agents have difficulties to perform arbitrary combinations and replacements of external policies.\nThe authors propose a new actor architecture for Knowledge-Grounded RL (KGRL),  Knowledge-Inclusive Attention Network (KIAN), which allows free knowledge rearrangement due to embedding-based attentive action prediction.  KIAN addresses entropy imbalance as well. The authors demonstrate in experiments that KIAN outperforms other methods incorporating external knowledge policies under different environmental setups."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The authors clearly define the problem as how RL can be grounded on any given set of external knowledge policies to achieve knowledge-acquirable, sample-efficient, generalizable, compositional, and incremental properties.\nThe proposed method of KIAN is clearly described. They use knowledge keys and the query performs an attention operation to determine how an agent integrates all policies. \nThe solution of the entropy imbalance issues when integrating external policies are proposed as well."
      },
      "weaknesses": {
        "value": "Generally this work has many related works but is tackling the unique challenge problem of fusing knowledge policies with different state and action spaces.\nLimitations of the proposed method is not clear based on the experimental results."
      },
      "questions": {
        "value": "More experiments directly connected with this challenging problem would more clearly support your claims."
      },
      "limitations": {
        "value": "Some insights and analysis about limitations based on the experimental environments more directly connected with the target problem are expected to be included."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The authors of this work introduce Knowledge-Grounded RL (KGRL), an RL framework that combines multiple knowledge policies to achieve human-like efficiency and flexibility in learning. They propose a new actor architecture called Knowledge-Inclusive Attention Network (KIAN) that enables arbitrary combinations and replacements of external policies through embedding-based attentive action prediction. KIAN also addresses entropy imbalance, a challenge in KGRL, addressing exploration in the environment."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "Firstly, the paper addresses a relevant and interesting problem in the field of reinforcement learning (RL) by improving sample efficiency from arbitrary external policies and enabling knowledge transfer skills. \nFurthermore, the paper is a well-written work that effectively conveys the ideas and findings in a clear and concise manner. The authors demonstrate excellent writing skills, employing appropriate terminology and organizing the content in a manner that enhances readability and comprehensibility.\nIn addition, the paper effectively establishes the motivation and position of the study in the existing literature. The authors articulate the significance and relevance of the research problem, demonstrating a strong understanding of the field. They situate their work within the broader scholarly context, highlighting how their study fills a gap in knowledge or builds upon prior research.\nThe methodology employed in the research is clearly described, allowing readers to understand and replicate the study. The authors provide a detailed and comprehensive explanation of the experimental and theoretical approach used, supported by well-designed figures and diagrams. These visual aids enhance the understanding of the methods employed and facilitate better comprehension of the research. Lastly, the authors provide solid mathematical understanding for their proposed method. \n\nCollectively, these strengths highlight the quality of the paper. ts focus on addressing a relevant and interesting problem, combined with its well-written content, clear methodology, positioning in the literature, and mathematical rigor, make it an intersting contribution."
      },
      "weaknesses": {
        "value": "The paper has one notable weakness that should be addressed to enhance the overall quality. The evaluation presented in the paper is quite limited. The results obtained for the OpenAI robotics task only offer a slight support for the proposed method. The authors should consider expanding the evaluation to provide a more comprehensive assessment of the proposed method's performance.\nAdditionally, the use of only 3 or 5 seeds in the experiments may be insufficient, especially when considering the large error bars observed in some models. The authors should consider increasing the number of seeds to improve the statistical robustness of the results.\nMoreover, the paper lacks clarity regarding the error bars shown in the plots. It is not explicitly stated what these error bars represent, which hinders the interpretation and understanding of the presented data.\nLastly, the paper would greatly benefit from conducting ablation studies to investigate the effects of various factors on the proposed method's performance. Specifically, the authors could consider performing ablation studies on \n- the influence and distribution of attention/weights of actors, \n- the impact of random/irrelevant policies in $\\mathcal{G}$,\n- the impact of the (near) optimal policy in $\\mathcal{G}$, \n- the impact of a larger set of knowledge policies $\\mathcal{G}$, \n- the effects of different types of knowledge policies, \n- and an investigation of the mentioned entropy balance issue, that the authors specifically address in their method.\nThese ablation studies would provide valuable insights into the individual contributions and impacts of these factors on the overall approach.\n\nOverall, addressing these weaknesses would significantly improve the research paper, clarifying important aspects such as error bars, conducting relevant ablation studies, ensuring consistency in reporting variances, and strengthening the empirical evidence for the proposed method.\n\n### Minor\n- I assume ori-KIAN is KIAN with the original $\\mathcal{G}$, this should be mentioned in the text. \n- l.314 mentions less variance, but tables do not show variances for individual experiments"
      },
      "questions": {
        "value": "See the above mentioned ablation studies."
      },
      "limitations": {
        "value": "The limitations have not been discussed by the authors.\nThe above mentioned ablation studies will probably help to identify the shortcomings of the proposed method."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper introduces KIAN, a method for leveraging multiple sub-optimal policies to solve reinforcement learning tasks. The paper starts out by introducing a new Knowledge-Grounded MDP, which adds a set of external knowledge policies to the traditional MDP framework. \n\nTo leverage these external knowledge policies, KIAN learns an embedding for each knowledge policy (including an inner knowledge policy for the current agent). Then at each step, the current state is mapped to a query embedding that can be used to find the policy that is best equipped to take an action at that timestep."
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "* The paper is structured well and is easy to read.\n* The authors demonstrated great attention to detail by motivating the theorems and equations with intuition before defining them concretely.\n*  The paper is very technically sound."
      },
      "weaknesses": {
        "value": "* > In such a case, whenever the knowledge set is updated by adding or replacing policies, prior methods require relearning the entire multi-policy fusion process, even if the current task is similar to the previous one. This is because their designs of knowledge representations are intertwined with the knowledge-fusing mechanism, which restricts the number of policies in the knowledge set from being changed.\n\n    * It would be good to point to specific prior works that suffer from this problem so the reader can build intuition.\n\n* There are no visualizations of the tasks used for evaluation. Adding pictures of the environments would help readers understand what the agent needs to do."
      },
      "questions": {
        "value": "*  I don't fully understand the incremental property. In the introduction. the authors state that \"Humans do not need to relearn how to navigate the entire knowledge set from scratch when they remove outdated strategies or add new ones.\" But then Definition 3.5 states that an incremental agent has two properties:\n    1. The agent can use different knowledge policies to solve a single KGMDP\n    2. Given a sequence of KGMDPs, the agent can solve them with different knowledge sets.\n\n    * In its current form, definition 3.5 does not specify the case where an agent adds or removes a specific policy from its knowledge set. I think a condition should be added to highlight how an incremental agent should be able to leverage a sequence of knowledge sets that differ by one or more policies.\n\n\n* How do the initial external knowledge policies perform on the given tasks?"
      },
      "limitations": {
        "value": "The authors discussed broader impact and future work in Appendix D, but no limitations were addressed. Could the authors please add limitations to either Appendix D or the conclusion?"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "Conditional Matrix Flows for Gaussian Graphical Models": [
    {
      "summary": {
        "value": "This paper concerns the estimation of precision matrix under $l_p$ norm sparcity penal. The solution is a variational inference through normalizing flow, which is a function of shrinkage parameter $\\lambda$ and non-negative norm parameter $p$. It allows for straightforward computation of solution paths for the intervals of $\\lambda$ and $p$, and was empirically evaluated on two relatively small data sets."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "Framework for GGM estimation based on conditional normalizing flows, indeed appears novel. Supporting math seems solid. \n\nUsing simulated annealing algorithm to recover a path of solutions for varying $\\lambda$ and $p$ is useful, in particular for the case of $p$, as in case of $\\lambda$ it was fairly straightforward to perform it with other methods too. I am just wondering how costly and scalable it is under the new framework, an empirical/theoretical analysis would be appreciated."
      },
      "weaknesses": {
        "value": "Empirical evaluation appears limited. It does not contain comparison with other (e.g. frequentist) approaches to derive the solution paths. Both in terms of estimation accuracy and in terms of computational cost."
      },
      "questions": {
        "value": "In synthetic data example, why did you choose to have more samples than dimensions ( $n>d$ )? Since in that case GGM can be obtained with matrix inverse, and no need for penalized objective."
      },
      "limitations": {
        "value": "Limitations were not discussed."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper targets the structure learning problem in Gaussian Graphical Models via (Normalising) Flow-based Variational approximation of the elements of weight metrics that correspond to the Gaussian Bayesian network. \nThey use sub-l1 pseudo norms to penalize dense precision metrics (which correspond to graphs with numerous links) without imposing an extra high penalty for large non-zero values (which typically occurs if $l_{\\geq1}$ is used)."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "1. Up to my knowledge, this is the first time flows are applied to the space of positive definite matrices. \n2. The proposed approach is flexible meaning the class of applicable prior and likelihood functions is quite large.\n3. Using sub-l1 norm is suitable for structure learning. \n4. The proposed algorithm is mathematically sound (as far as I can follow) and is quite interesting. \n5. The paper is well-written, and the relevant work is sufficiently discussed.    \n6. Due to its flexibility, the proposed method has the potential of having a large impact."
      },
      "weaknesses": {
        "value": "Due to the factors mentioned in the previous section, I find this work impressive and beautiful. However, unfortunately, the carried out experiments are minimal. Most notably, the algorithm is compared to no alternative work (neither in the main paper nor in the supplementary material). With no quantitative comparisons, it is impossible to evaluate the performance of the proposed algorithm compared to the existing methods. \n\nNOTE: In the Rebuttal, some experiments are carried out (though the code is still not accessible).    \n\nMinor suggestion: \n1. Though it is clear in the context, I suggest that the authors do not use the same letter \"p\" (with the same font) for both probability density and norm parameter.  \n2. Fix minor typos e.g. the end sentence period in line 214."
      },
      "questions": {
        "value": "* In line 141, what do you mean by \"contradiction\"?"
      },
      "limitations": {
        "value": "The authors should compare their method with the relevant structure learning lierature and reveal its points of strength as well as its limitations. \n\nThis work is theoretical/methodological and does not have any positive or negative social/ethical impact on its own."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper proposes a method that can be used to infer conditional independencies in a Gaussian model. These conditional independencies are related to zeros in the precision matrix. Typically, sparse enforcing norms are used to estimate the precision matrix while enforcing zeros in the elements outside of the diagonal. In this paper a Bayesian approach is considered. For this a pseudo-distribution for the data is considered by taking the exponential to the p-norm. The method is trained via variational inference combined with normalizing flows to increase the accuracy of the posterior approximation. The variational distribution is tuned via simulated annealing and a temperature parameter allows to interpolate between the Bayesian and the Map solution."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "- Well written paper.\n\n        - Illustrative toy experiments."
      },
      "weaknesses": {
        "value": "- The proposed method is a combination of already known techniques.\n\n        - The experimental section is weak as only a single real problem is considered.\n\n        - Although the proposed method is a generalization of several known techniques, I have found in the experimental section a lack of comparisons with other related methods.\n\n        My main point of criticism is the weak experimental section which only considers a single real problem and no comparisons with other related methods are carried out in real problems.\n\n        Another point of criticism is that, for some particular values of the p parameter one does not actually observe sparsity in the Bayesian solution. For example, when sampling from the Laplace distribution one never observes zeros in practice. Spike and slab priors (a mix between a Gaussian and a point of mass center at zero) are the ones that actually lead to zeros."
      },
      "questions": {
        "value": "None"
      },
      "limitations": {
        "value": "The authors have not commented on the limitations of their approach."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This work proposed a framework for performing inference on Gaussian Graphical Models by approximating the posterior with a normalizing flow over PSD matrices. In this way, the authors can investigate $l_p$-norm regularized GGMs for any value of $p$ in an efficient way."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The idea of using normalizing flows for GGM inference definitely brings in advantages of both Bayesian and frequentist worlds; to me, that's an innovative idea."
      },
      "weaknesses": {
        "value": "The main weakness that I identified is the lack of comparison between the proposed framework and the well-studied graphical lasso with concave approximations of the $l_0$-norm. More precisely, the authors show that their framework obtains frequentist solution paths through simulated annealing, therefore, it'd be of great interest to see a comparison between these solution paths and those obtained by iterative algorithms such as iterative reweighted l1-norm for graphical lasso."
      },
      "questions": {
        "value": "- in the frequentist case, how does the proposed framework compares against more classical techniques to obtain the solution paths, e.g., iterative reweighted l1-norm? "
      },
      "limitations": {
        "value": "The authors adequately addressed the limitations of their proposed framework. "
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "Matrix Compression via Randomized Low Rank and Low Precision Factorization": [
    {
      "summary": {
        "value": "The paper introduces a low rank, quantized/low precision matrix factorization which decomposes an n x d matrix A in the form A= LR, where L (of size n x m) and R (of size m x d) are low rank factors. L and R are computed using a random projection matrix S in the form L = Q(AS) and R = Q'(W^*) where W^* is the matrix minimizing the squared Frobenius norm ||Q(AS)W− A||. Q and Q' are two independent quantizers with specified budgets. \n\nThe authors contrast their method with an SVD based method for computing the quantized low rank approximation which instead sets L = Q(U_k S_k) and R = Q'(V_k), where U_k/V_k and S_k are the singular vectors/values respectively. The paper has a theorem deriving a bound on the Frobenious norm of the factorization eror. They apply the approximation on image data (for image compression) and embedding matrices (for an embedding classifation task).\n"
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "+ The paper is very well written and very clear in its presentation\n+ Clear technical presentation incl. theorems, algorithms etc.\n+ Novel idea, providing good review of relevant literature (different matrix sketching approaches, quantization etc.)\n+ Thoughtful experiments to demonstrate real world application (using embedding compression)\n"
      },
      "weaknesses": {
        "value": "I don't see any weaknesses that need to be addressed at this moment."
      },
      "questions": {
        "value": "* In Table 3, why are the SVD and Naive quant. Frobenious norm errors the same for different rank choice? Is it because the matrices are really low (<15) rank? \n\n* I think Table 3 may be expanded to a set of figures to better convey the message (with potentially more bit budgets)."
      },
      "limitations": {
        "value": "This is an optimization paper and as such the limitations are not immediately obvious, though the eventual use of the model for downstream compression/computation speed up could be quite broad. The societal impact could also be positive given the matrix compression can lead to compute/energy savings. The paper doesn't have a dedicated discussion/section on any limitations. "
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper studies the low-rank factorization of the matrix in the low-precision setting and proposes a new algorithm which is a combination of randomized low-rank approximation method and quantization.  The paper formally analyzes the guarantee of the proposed algorithms and also give experiments on real world dataset which demonstrate the advantage of the proposed algorithm."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "1. The presentation of the paper is good. The writing of the paper is clear and easy to follow.\n\n2. To get the formal guarantee, the authors do a careful analysis, which I think is non-trivial."
      },
      "weaknesses": {
        "value": "1. Technical novelty: the main algorithm (Algorithm 1) seems to just be the standard way in randomized numerical linear algebra then plusing the quantization. Can you authors give more explanations about the technical novelty? (though the analysis I think is not standard)\n\n2. Experiment: I have some questions about the setting and details of the experiments section. See the next question."
      },
      "questions": {
        "value": "1. Theorem 3.2 shows the guarantee of the proposed algorithms. However, would the sketch size $m$ also have the requirement given the accuracy parameter $\\epsilon$ and $k$? Also in experiment it may be a factor that affects the runtime and accuracy a lot, is there some place indicating the choice of $m$?\n\n2. I am a little confused about the naive quantization baseline. Can this way make the matrix be low-rank?\n\n3. As mentioned in the paper, the sketching-based method is popular in randomized low-rank approximation. I think in the experiment the baselines should also include it (with the naive way of quantization).\n\n4. The paper discusses the runtime complexity. Hence, I think it would be better to include the runtime in the experiment section."
      },
      "limitations": {
        "value": "See the above questions."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper proposed a memory efficient approach to approximate a matrix $A$ by: low-rank approximation $A=LR$ and quantization. The LPLR algorithm first applies a quantized random projection (RP) as the $L$, and then solve a minimization problem for the right loew-rank factor $R$, which is also quantized afterwards. Theoretical approximation error is obtained and compared with an alternative approach that quantized SVD low rank factors instead of RP. Experiments are conducted on image approximation and embedding classification, to show the effectiveness of the proposed method."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "1. The paper is well-organized and easy to follow. The theoretical analysis seems rigorous.\n\n2. Experiments on multiple ML tasks and datasets are provided which make the results more grounded."
      },
      "weaknesses": {
        "value": "In my understanding, the main idea of the paper is to waive the need to compute the SVD of A, by using random projection (RP) as a surrogate. I have the following concerns and suggestions:\n\n1. At line 220, the authors wrote that the bits per entry for SVD-quant is $O(nd\\sqrt k)$, but in Table 1 and Table 2, it is $O(k\\sqrt{nd})$. Please double check and clarify. Also, the authors simply stated that LPLR is better than SVD-quant in terms of bits per query, which is not true with some n, d, m, k (comparing the results in the table). I suggest the authors to carefully compare the results and state the regimes when LPLR is better, and when it is worse.\n\n2. In the main Theorem 3.2, $\\kappa$ could be negative, right? Is $1-c_4\\sigma_k/\\sigma_{k-1}$ bounded? Or do we need to further assume an eigen gap for this result to hold?\n\n3. I understand that the main usage of LPLR is for matrix (data) approximation, so the first experiments (Figure 1 and Table 3) make sense to me. However, for the second set of experiments on classification, why not directly using $Q(AS)$ (i.e., the quantized random projections)? This saves the storage for W (in other words, we may increase the sketch size m when using Q(AS) only). Some recent references on this include\n\nRandom projections with asymmetric quantization, Li and Li NeurIPS 2019\n\nGeneralization error analysis of quantized compressive learning, Li and Li, NeurIPS 2019 \n\nIndeed, the research on QRP is highly related to this submission, since LPLR essentially does an optimization on W to recover the data from QRP. I suggest to add some discussion on this direction in the paper and some empirical comparisons.\n\n4. Also, if LPLR is used for processing or storing the data for classification or search tasks, it might be inconvenient to handle new data points (e.g., in a streaming setting). Thus, it may not be suitable for such tasks. On the other hand, recently people are using low rank approximation in LLM fine-tuning frequently. Experiments related to fine-tuning language models could be a better application scenario for the proposed method.\n\n5. Some references on similar results are missing. A similar result as in Appendix D that $S^TQ(AS)$ with uniform quantization has approximation error independent of $d$ has been established in [EDEN: Communication-Efficient and Robust Distributed\nMean Estimation for Federated Learning, Vargaftik et al., ICML 2022] (or maybe some even earlier paper) for rotation matrix $S$. This related result should be cited. Also, Eq. (2) is a standard result for uniform stochastic rounding. A reference should be added there.\n\nIn all, I think the paper proposes a simple but intuitive method for low-rank low-precision matrix approximation from QRPs. The idea is clear, the analysis seems sufficient (despite the above and below questions).The experiments can be improved, but the current results on several tasks and datasets are convincing enough to show the effectiveness of LPLR in matrix approximation. For now, I would recommand borderline accept. "
      },
      "questions": {
        "value": "1. Proposition D.1 only bounds the error between $Q(Sx)$ and $Sx$. How does it imply $||S^TQ(Sx)-x||^2$ is also a constant?\n\n2. What solver is used to solve Algorithm 1 line 4? This should be clarified. Is closed-form feasible?"
      },
      "limitations": {
        "value": "NA."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper studies compression of low-rank matrices by simultaneous low-rank factorization and quantization. It proposes a method that first quantizes the randomized rangefinder as the first low-rank factor and then quantize the minimizer of reconstruction error with respect to the remaining factor as the second. Randomized rangefinder uses random Gaussian matrix which possesses the equalization property to maintain low quantization error, compared to naïve quant. Experiments are provided to demonstrate the benefits of the proposed algorithm."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. provide a low rank factorization algorithm that come with quantization for further reducing memory footprint.\n2. experiments demonstrate the advantage of the algorithm."
      },
      "weaknesses": {
        "value": "1. experimental settings should be made clearer. the current description is a bit confusing. \n"
      },
      "questions": {
        "value": "1. what is the difference between LPLR and LPLR-SVD in experiments?\n2. Accuracy seems to decrease with bits for some cases in experiments. Why?"
      },
      "limitations": {
        "value": "No limitations are addressed in the paper."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The authors investigate combining low-rank matrix factorization and (uniform scalar) quantization.\nThrough theoretical analysis and experiments they demonstrate that this can yield much higher accuracy than directly quantizing the input matrix. One natural choice is to compute the SVD of the matrix and quantize the two factors independently. It's shown that quantizing the left factor first and then computing a new right factor that best approximates the input when multiplied with the quantized left factor yields much better result. The choice of SVD is not critical and could be replaced by randomly mixing the columns of the input matrix, i.e. random sketching. In fact sketching has provable benefits as the entries of sketched matrices are bounded with very high probability. This bounded range improves quantization theoretically. The authors prove several theorems (their proofs are in the extensive appendix) and conduct detailed empirical evaluation."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1) All the key ideas of the paper (low-rank approximation, sketching) are sound.\n2) Detailed theoretical analysis with rigorous proofs.\n3) Extensive experiments.\n4) Compression of neural network weights and embeddings via low rank approximation and quantization are popular and impactful topics both to reduce memory usage and to speed up training and inference.\n"
      },
      "weaknesses": {
        "value": "1) Neither the ideas nor the analysis are particularly inventive in my opinion. It's self evident that optimizing the second factor after quantizing the first (LSVD) is superior to independent quantization (DSVD), in fact the process could be iterated further. While I appreciate the 30+ pages of proofs provided by the authors it seems as if they rely on chaining known results and techniques for sketching and random matrices combining with patient algebra.\n2) Despite its seemingly weaker theoretical bounds LSVD is always one of the most accurate method in the experiments (see Tables 4-7). This is also clearly highlighted by the authors in the limitations section. \n3) Quantization aware training (not considered in the paper) is highly likely to produce equivalent or better results.\n"
      },
      "questions": {
        "value": "1) Line 226 and Theorem 3.2: For (1+eps') relative Frobenius error approximation LPLR requires m=O(k/eps') >> k columns, which the text seems to overlook. Could you please discuss?\n2) Table 3: Could you also add LSVD to this experiment too? DSVD's Frobenius error is always the same 0.496, and LPLR's error is the same  the bottom of the table, when the bit budget is doubled, as in the top of the table. Could you discuss why? What was the rank (k) of DVSD, was it the same as m of LPLR? I.e. could you make Rank column header precise?\n3) Matrix entries are typically rescaled to [0,1] before quantization as it's cheap to store their min/max (or some very low/high quantiles), even for each row (or column) of a matrix. How would such rescaling change your theoretical and empirical results?\n\n4) Line 77: Sx -> x\n5) Table 1, row of LPLR: delta is undefined\n6) Lines 219-222: missing log2(), 4 times\n\n"
      },
      "limitations": {
        "value": "Yes, limitation section is adequate."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper introduces a novel low-rank matrix factorization algorithm that is using sketching matrix idea and quantization, such as they do:\n\n1. Use Gaussian RV to generate sketch of the matrix and compute the approximate basis\n2. Use Quantization with Q - to get Q(AS)\n3. Use Q(AS) and Q' to get  Q'(W)\n4. Return Q(AS) and Q'(W)\n\nAuthors provide theoretical and numerical analysis of their idea."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "- introduction section written very well & and very informative and to the point, such as introducing LPLR algorithm briefly, talking about Low-rank approximation and Randomized quantization.\n\n- the introduced algorithm clearly communicated and results are theoretically sound."
      },
      "weaknesses": {
        "value": "- Abstract seem to be a bit wordy - it would be nice if there were formulations and numbers that grabs readers attention with resutls.\n\n- i like the way motivating the work - with memory constraints - but i am curious is there any application in real life for low rank decomposition that actually saves memory. some examples would be good\n\n- the paper doesn't exactly introduce a new direction - rather seems to be using existing ideas and put them together."
      },
      "questions": {
        "value": "Table 1 & 2  is a bit puzzling me - it seems that Approximataion Error of Naive Uniform is smaller than LPLR and with cheaper computation cost. Do you think that you can clarify in the table itself  - why LPLR is better ? because it seems to be confusing in the first glance."
      },
      "limitations": {
        "value": "The are many sketching / matric factorization algorithms, i am puzzled why we only presented Naive Uniform and Direct SVD algorithms as comparison points."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This work studies the problem of computing a low rank approximation when the low rank factors are under a bit budget constraint, that is, we must output factors L and R with bounded bits such that LR approximates a given input matrix A in the Frobenius norm. The authors show that by incorporating sketching into the quantization procedure, one can get improved bounds, due to the fact that a Gaussian sketch can “flatten” the entries of a vector, which is advantageous when rounding (Appendix D). Empirical results show that this algorithm indeed gives improved results over other naive implementations such as directly rounding SVD factors. "
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The problem of efficiently quantizing low rank approximations is an extremely important problem given that both low rank approximations and low precision is gaining popularity for compressing massive neural networks (https://papers.nips.cc/paper/2020/file/13b919438259814cd5be8cb45877d577-Paper.pdf, https://arxiv.org/abs/2302.03764). This work offers an interesting new method which takes advantage of the “flattening” property of Gaussian sketches in order to obtain improved results for quantization in the context of low rank approximation. This idea is conceptually simple yet interesting. Empirical results are also convincing."
      },
      "weaknesses": {
        "value": "The contribution is already quite nice, but there are several followup investigations that could strengthen this work much more:\n* Are there any lower bounds on the trade-off between the approximation accuracy and the bit budget?\n* There are structured sketching transforms such as the Subsampled Randomized Hadamard Transform (see Theorem 2.4 of http://www.cs.cmu.edu/afs/cs/user/dwoodruf/www/wNow3.pdf) which also have the “equalizing” or “flattening” type of behavior, yet can be applied in much faster time, and furthermore also save on the storage of the sketching matrix since it is an integer matrix. Can this be used to get faster implementations in theory/practice? \n* Can you report the running time of the experiments?\n* Can you comment on whether the bit bounds imply actual savings in the memory usage, or are the practical implementations of bit complexity too crude to capture these improvements? "
      },
      "questions": {
        "value": "* Should put A \\approx LR in the abstract\n* Some of the references in the Related Works section for Low-rank approximation seem inappropriate for the context. Candes-Tao and Recht et al are not focused on faster algorithms for SVD, but rather a related but different problem of matrix completion. Gradient descent on the low rank factors is indeed one way to solve approximate SVD, which I agree Zhang et al captures, but there may be more appropriate references such as https://arxiv.org/abs/2106.14289 and references within.\n* Line 58: you should first establish that n >= d, or else the SVD time should be O(min{nd^2, dn^2})\n* Typo (line 77): should be “instead of quantizing x directly”\n* Is the randomized rounding in Section 2.1 necessary? Can you get better results with naive rounding?\n* Line 177: what do you mean by “saturated” and “unsaturated”? Please define this term, it is unfamiliar to non-experts."
      },
      "limitations": {
        "value": "Discussion of limitations is limited. This work is mainly theoretical, and there are no potential negative societal impacts."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "Color Equivariant Convolutional Networks": [
    {
      "summary": {
        "value": "This paper proposes color equivariant convolutional networks (CE-CNNs), a novel convolutional neural network architecture that achieves equivariance to hue changes.&#x20;\n\nThey introduce color equivariant convolutions that apply a discrete set of hue rotations to the convolution filters during the forward pass. This makes the network output invariant to corresponding hue changes in the input image.\nThey propose a group coset pooling layer that pools feature maps over the group of hue transformations to achieve invariance.\nThey evaluate CE-CNNs on several image classification datasets, showing improved robustness to hue changes at test time compared to regular CNNs. The method also improves absolute classification performance in some cases.\nOverall, the paper presents a novel and intuitive technique to build invariance to hue changes into CNNs. The evaluations demonstrate its advantages over standard networks, especially under shifted hue distributions between training and test."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "This paper introduces a clever yet intuitive technique to make convolutional neural networks invariant to hue changes in the input image. The core idea is to apply discrete hue rotations to the convolution filters during the forward pass, essentially \"baking in\" robustness to color changes.\n\nThe paper is clearly written and easy to follow. The authors motivate the problem well, explain their proposed method succinctly, and provide thorough experimentation across image datasets. The visualizations offer useful insights, confirming that the networks learn consistent features across hues.\n\nOverall, I found this to be an original and significant contribution. Invariance to hue shifts is a practical problem, and this paper tackles it through an elegant approach that outperforms regular CNNs. The concept of encoding transformations into convolutions seems powerful. While not the flashiest technique, the method is thoughtful, principled, and achieves strong results. The paper is presented clearly and comprehensively, making the ideas accessible. In summary, this is a high quality paper with both theoretical and practical value."
      },
      "weaknesses": {
        "value": "-   The method is demonstrated on image classification, but it's unclear how well it would generalize to other tasks like detection or segmentation. Additional experiments on other applications could strengthen the claims.\n-   The ablation study on number of hue rotations suggests performance varies across different shifts. It would be useful to dig deeper into why - is it an artifact of how shifts are applied? Better understanding this could improve results further.\n-   The approach encodes discrete hue rotations. An interesting extension could be supporting continuous rotations for finer-grained equivariance.\n-   The comparisons to \"grayscale\" networks should be interpreted carefully, as removing color information entirely handicaps models. Comparisons to networks pre-trained onImagenet may be more meaningful.\n-   The Flowers-102 experiments indicate the method doesn't help much on datasets without color bias. Analyzing when color equivariance helps or hurts could guide adoption."
      },
      "questions": {
        "value": "1.  The amount of color jitter augmentation during training seems to significantly impact performance. Could you do an ablation or analysis to tease apart the direct benefits of the color equivariant convolutions versus the data augmentation?\n2.  Have you evaluated the method on larger-scale datasets like ImageNet? Results on more complex data could better demonstrate the scalability.\n3.  The choice of 3 discrete rotations seems arbitrary. Can you analyze the impact of the group size to help guide selection? Are there benefits beyond 3 rotations?"
      },
      "limitations": {
        "value": "1.  The comparison to only a ResNet baseline limits the conclusions on the benefits of the proposed method. Comparisons to other approaches could provide useful context.\n2.  The long-term impacts of building color equivariance into models is unclear. Discussion of downstream effects on fairness and interpretability could be beneficial."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "Paper proposes color-equivariant CNN layers by imposing equivariance to H_n (a discrete subgroup of SO(3)) in the RGB space which is imposes hue equivariance. Implementation follows the framework of Group-equivariant CNNs. Experiments show marginal improvements over standard CNNs for in-distribution test data but significant improvements when test data is hue-shifted."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. Color equivariance in CNNs is a relatively less-studied but an important topic for robustness. The proposed idea of incorporating equivariance to hue transformations via rotations in the RGB space is novel. \n2. Experiments are setup well clearly showing when color equivariance is helpful vs color invariance vs no symmetry. Proposed approach shows improves over CNN even when in in-distribution test data, but major improvements come when test data is hue-shifted."
      },
      "weaknesses": {
        "value": "1. Definition of color equivariance considered in the paper seems to be restricted as it only considers the hue dimension. One of the motivations for incorporating color equivariance is for robustness to illumination changes which I do not think is guaranteed here. A general definition of color-equivariance should consider other dimensions. Maybe the claims are better justified if Hue-equivariance is emphasized in the title/introduction/method name, etc.\n2. The definition of hue-equivariance is not precise in the paper. Ideally, it should include all rotations in the RGB space (i.e., SO(3)), but also consider the fact that many of these rotations take the color values out of the RGB space (unit cube). In general, this issue occurs for the discrete subgroup $H_n$ as well. Simply projecting the color values back into the RGB space does not work as it breaks the invertibility property of these transformations. \n3. Experiments compare with a standard CNN (+grayscale) as baseline. Other baselines can be included, for example [1], that considers invariance to illumination color/intensity. \n4. Experiments in the main paper only consider the group $H_3$ (i.e., 3 rotations in the RGB space), which seems limited in robustness, as shown in Figure 1 without jitter augmentations. \n\n\nReferences:\n\n[1] Lengyel, Attila, et al. \"Zero-shot day-night domain adaptation with a physics prior.\" _Proceedings of the IEEE/CVF International Conference on Computer Vision_. 2021."
      },
      "questions": {
        "value": "1. How is the hyperparameter $s$ chosen for different datasets in Table 1, especially for hue-shifted test dataset (assumed not known during training/validation)?\n2. Is the invariance captured by Grayscale-Z2CNN same as that considered in the paper, i.e., invariance to hue? Would a better preprocessing step be only considering a canonical representation in the hue dimension?\n3. In the color-imbalance experiments, were the CNNs trained with loss weighted according to the class imbalance? \n4. Except being computationally expensive, are there other issues with using $H_n$ for higher n? Ablation in the Appendix seem to show better robustness with higher n, and also good in-distribution performance (at 0 hue shift). So I am not sure why $H_3$ alone was considered in the main paper.\n5. It would be helpful to add a few lines of summary on the ablation studies in Sec 4.2.\n6. Can experiments in Section 4.1 include CNN+jitter as it seems to provide competitive performance in Section 4.2?\n\n\n**AFTER REBUTTAL**\n\nAuthors have addressed most of my concerns, particularly, adjusted the claims regarding color vs hue equivariance and added relevant baselines. I am increasing my score as I think this paper can be an important addition to an understudied topic. \n\nHowever, I am still concerned about the mathematical definition of hue-equivariance (via H_n group) since these transformations can map a color outside the unit cube and projecting back loses invertibility requirement of a group. I accept that this may not reduce performance in practical tasks (except certain inconsistencies pointed out by the authors), but I believe it is not mathematically correct."
      },
      "limitations": {
        "value": "Limitations should discuss lack of robustness to other color dimensions (e.g., illumination)."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The authors introduce a color equivariant convolutional neural network. To achieve this the authors represent the image in HSV format, and achieve hue equivariance using methods for rotational equivariance. This is possible since hue can be represented by an angle. The authors show that the proposed approach out performs standard CNNs and color invariant CNNs when there is a hue shift between the train and test set."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "* Originality: The presented method of building a color equivariant CNN appears to be original. \n* Quality: The work appears to be of fairly good quality. \n* Clarity: The paper is well written. \n* Significance: The observation that color equivariance can be achieved by identifying hue with the rotation group is interesting. The results show the proposed approach leads to improved performance when there is a color based domain shift."
      },
      "weaknesses": {
        "value": "* Quality: I have some questions about the mathematical presentation, and experiment design (see questions).\n* Clarity: Some aspects were unclear to me, due to presentation or motivation (see questions)"
      },
      "questions": {
        "value": "* regarding equation 3. I believe the correlation should be between the feature maps and $C^{l+1}$ filters [7]. I think it could be clarifying to write that $c$ is the input channel and $i$ is output channel.\n* regarding equation 6: I'm not sure I understand how does H_n(k) acts on \\psi_c? In the case of group 2D rotation equivariance, the filters are transformed by in plane rotations. It is not clear to me how one can perform a 3D rotation of a filter with an arbitrary number of channels.\n* It seems to me that the network is designed for local hue equivariance, can the authors clarify the benefit of this over global hue equivariance (i.e, performing hue shift on the input image then processing all inputs with the same cnn, and combining representations at the final layer to get a hue-equivariant representation)?\n* Does computational expense improve if input images are converted to HSV before being passed into the network? In this case, I expect hue equivariance could be achieved by discretization of the 2D rotation group rather than a 3D transformation.\n* Have the authors experimented with finer/coarser discretizations of the hue/rotation group\n"
      },
      "limitations": {
        "value": "* Limitations -- in particular the issue of computational cost -- are communicated"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper questions the importance of color variations for neural classifiers and proposes to use color-equivariant architectures in the case of unbalanced datasets.\nTo demonstrate the validity of the presented approach, the authors conduct experiments both on synthetic controlled datasets and on common object recognition benchmarks.\nAs the experiments show, the injection of color-equivariant layers leads to a slight improvement on almost all common benchmarks when the performance is measured on the original test set but the advantage of the presented method becomes more evident when the test data is corrupted with hue shifts."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "This paper studies an interesting and underinvestigated question of the importance of color representation for neural networks.\nThe submission is easy to read, and the motivation is well explained in the example of the Flowers dataset. \nThe authors have conducted a significant number of experiments to support their claims.\nAdditional strength is that the demonstrated performance improvement is achieved without increasing the number of trainable parameters (line 238)."
      },
      "weaknesses": {
        "value": "1. While the idea of extending equivariance from geometric to photometric transformations is definitely interesting, the submitted manuscript, unfortunately, focuses on the only type of such transformations, i.e. hue shifts. Despite the case of the Flowers dataset is a perfect fit for this transformation, the authors do not discuss other use cases when this type of equivariance may be interesting in practice and just mention \"accidental recording conditions\" (line 3). For other datasets, hue shifts seem less meaningful, and the better robustness of the proposed CE-ResNets to such shifts at test time is explained by the fact the architecture was just intentionally designed for this scenario. Taking this into account, I find the scope of the paper a bit limited.\n\n1. In addition to being limited in the number of considered photometric transformations, the paper also considers a single task of object recognition. I would encourage the authors to consider other tasks as well, e.g. unsupervised domain adaptation.\n\n1. While the authors claim their approach makes networks more robust to test time corruptions (Tab. 1), they do not demonstrate other baselines aiming to provide robust outputs, e.g. adversarially robust models."
      },
      "questions": {
        "value": "1. I ask the authors to discuss the weaknesses stated above. The main thing I am interested in is the usage of robust baseline models.\n\n1. While preserving the number of trainable parameters is valuable, I wonder if the network throughput remains the same for color-equivariant architectures in comparison with the baselines. If this is not the case, how significant is the decrease?"
      },
      "limitations": {
        "value": "Limitations are addressed adequately."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "VideoComposer: Compositional Video Synthesis with Motion Controllability": [
    {
      "summary": {
        "value": "The paper presents a method for compositional video synthesis. It introduces motion vectors from compressed videos as a control signal for temporal dynamics. The motion vector can be combined by other conditions such as sketch, and depth map. Both qualitative and quantitative results show that the proposed method can control the spatial-temporal patterns. "
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "+ The motion controlled generation result (fig 8) using hand-crafted strokes is interesting. \n\n+ Table A1 shows effectiveness of the proposed method quantitatively compared to previous methods.\n\n+ The paper is well written and easy to follow."
      },
      "weaknesses": {
        "value": "- There are a few GAN-based video synthesis approaches that are worth discussing in the related work. For example, MoCoGAN [1] approaches the problem by decomposing motion and content. \n \n- The two-stage training strategy needs more clarification. What is \"compositional training\" particularly in the second stage?  How does it differentiate from the \"text-to-video\" generation in the first stage?\n\n- In line 164-165, the authors \"repeat the spatial conditions of a single image and single sketch along the temporal dimension\". If the input condition is simply repeated, what's the point of applying a temporal Transformer? It will be equivalent to applying the spatial operation only and repeat at the latent space but with higher computation cost, no? (for motion vector, I totally agree that a spatial-temporal modeling would be necessary.)\n\n- Motion vectors can be less meaningful in the background due to lack of high-level semantics. It can also be clearly seen from the top row in Fig 4. I wonder if the authors treat the motion vector field equally for all locations. It seems that the generated results with motion conditions has more blurry background.\n\n- From Figure 2 and Figure 1(d), my impression is that the conditions (say motion and depth) can be combined together. However, in ablation studies (table 2), only one condition is added at a time. Another ablation that studies all combinations of these conditions will be favored. \n\n[1] Tulyakov, Sergey, et al. \"Mocogan: Decomposing motion and content for video generation.\" CVPR 2018."
      },
      "questions": {
        "value": "1. In the video translation demo (2:11-2:16), the right example's output does not have a consistent color (white before jumping and brown afterwards). Is there any particular reason why the color consistency fails to hold in such a case?\n\n2. I'd suggest moving some quantitative results (Table A1) to the main text.\n"
      },
      "limitations": {
        "value": "The authors have addressed the limitations in the supplementary materials."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "VideoComposer is a tool designed to enhance video synthesis by incorporating textual, spatial, and temporal conditions. It uses motion vectors from compressed videos to guide temporal dynamics and employs a Spatio-Temporal Condition encoder to effectively integrate spatial and temporal relations of inputs. This improves inter-frame consistency and allows for greater control over the synthesized video's spatial and temporal patterns.\n"
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "The VideoComposer offers better control over video synthesis, temporal guidance using motion vectors, improved inter-frame consistency with its Spatio-Temporal Condition encoder, versatility in accepting various forms of inputs, and high customizability, resulting in more precise and desired synthesized videos."
      },
      "weaknesses": {
        "value": "An ablation study could be conducted on VideoComposer, where each component is removed in turn to evaluate its impact on overall performance. This would help evaluate the value of training under multiple conditions versus a single condition. \n\nAdditionally, comparing VideoComposer to a simpler method like Text2Video-Zero [a] with ControlNet [b] would demonstrate whether the increased complexity of VideoComposer yields significantly better results, hence justifying its sophistication. \n\n[a] Text2Video-Zero: Text-to-Image Diffusion Models are Zero-Shot Video Generators, L Khachatryan et al.\n[b] Adding Conditional Control to Text-to-Image Diffusion Models, L. Zhang et al. "
      },
      "questions": {
        "value": "How are image-text pairs utilized in the training process of the model?"
      },
      "limitations": {
        "value": "What are the limitations?"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This work proposes a new method called VideoComposer for conditional video generation, especially for video-to-video translation. VideoComposer is constructed upon the Video Latent Diffusion Model and introduces an STC-encoder to integrate multiple spatial and temporal conditions such as RGB images, sketches, motion vector sequences, etc. The architecture design involves simple 2D convolutions and temporal transformer layers. The conditional features are fed into the U-Net input together with noise. The demonstrated results have good temporal consistency."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "- This is one of the pioneering works in controllable video synthesis. The temporal consistency of the video results is impressive, considering that its conditioning modeling enables several editing abilities such as image-to-video translation and motion/depth/sketch-driven local/global video editing.\n\n- The jointly training strategy is good for flexible inference within one model, e.g., video inpainting, without second training.\n\n- The paper organization and illustrations are easy to follow."
      },
      "weaknesses": {
        "value": "- The authors could have tried other design choices for integrating Condition Fusion as input into the U-Net, such as integration through cross-attention.\n\n- In line 215, it is claimed that “we observe that the inclusion of mask and style guidance can facilitate structure and style control.” However, the corresponding evidence should be presented for the style representation extracted by clip image encoder and concatenated with text embedding.\n\n- It seems that a single STC-encoder is used for all different conditions via random dropout. It would be interesting to see if different STC-encoder weights for different conditions are better.\n\n- The examples in Figure 6 with reference image look like failure cases. Besides, the tiger texture and box shape are changed in Figure 8. It would be helpful to see more discussion and analysis on this part.\n\n- The ablation study of STC-encoder is not presented in a fair way. The main benefit of using STC-encoder comes from the video information condition instead of the network design.\n\n- The important comparisons and discussions with other methods are not sufficient, such as VideoP2P and vid2vid-zero mentioned in the related works."
      },
      "questions": {
        "value": "The comparisons with other methods are not sufficient and the ablation study is not well presented."
      },
      "limitations": {
        "value": "The societal impact has been discussed."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This work aims to allows users to flexibly compose a video with textual conditions, spatial conditions, and temporal conditions.\nIt introduces a novel framework namely VideoComposer based on the paradigm of compositional generation.\nTo be specific, it introduces the motion vector from compressed videos as an explicit control signal to provide guidance regarding temporal dynamics.\nMoreover, it develop a Spatio-Temporal Condition encoder (STC-encoder) that serves as a unified interface to effectively incorporate the spatial and temporal relations of sequential inputs, with which the model could make better use of temporal conditions and hence achieve higher inter-frame consistency. \nExtensive experiments demonstrate that VideoComposer control the spatial and temporal patterns simultaneously within a synthesized video in various forms."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. It introduces motion vector as a more flexible user-guided signal.\n2. It proposes Spatio-Temporal Condition encoder (STC-encoder) that serves as a unified interface to effectively incorporate the spatial and temporal relations of sequential inputs.\n3. Extensive experiments show the effectiveness and superiority of VideoComposer."
      },
      "weaknesses": {
        "value": "1. What is the difference between the roles of the ``Style`` of CLIP and ``Single Image`` of STC-encoder? They both seem to provide content to videos.\n2. VideoComposer only obtain comparable performance with prior video generative models. Is it more efficient than previous methods? The authors could give their comparisons in training cost and inference time.\n3. Lack of extensive visualization comparisons with existing video generative models. The authors are encouraged to provide extensive qualitative comparisons in video generation task.\n"
      },
      "questions": {
        "value": "See weakness."
      },
      "limitations": {
        "value": "Yes."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "SiT Dataset: Socially Interactive Pedestrian Trajectory Dataset for Social Navigation Robots": [],
  "Automatic Clipping: Differentially Private Deep Learning Made Easier and Stronger": [
    {
      "summary": {
        "value": "The script proposed an automatic clipping methods for various DP algorithms. The problem is important because the performance of DP models are sensitive to the choice clipping threshold, yet there is no theorical guidance for tuning it. \n\n"
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The writing is clear and the paper is easy to follow. The idea is simple and effective.  Theory and experiments are provided to show the efficacy of the proposed automatic clipping method. I think this result is worth sharing with the DP community. \n\n\n\n"
      },
      "weaknesses": {
        "value": "See below"
      },
      "questions": {
        "value": "**Only one question:**\n\nAccording to to line 140, Auto-V maximizes the dot product similartiy **only when** <g_i, \\sum_j g_j> >0 for any i.  However, in practice, <g_i, \\sum_j g_j>  could be negative, but Auto-V still perform gradient normalization on these samples. I wonder: what if we only normalize g_i with <g_i, \\sum_j g_j> >0 and ignore the rest, (i.e., do exactly the optimal normlization in line 140). Will it bring better performance? Similar question also goes to Auto-S.\n\n\n\n**Suggestions:**\n\nI suggest add index to the equations in line 138 and 140. "
      },
      "limitations": {
        "value": "See above"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper introduces 'automatic clipping' to replace the usual clipping operation in DP-SGD. The challenge of usual clipping is to choose a good threshold 'R' especially for deep learning models. The authors claim that automatic clipping maintains the same level of privacy and computational efficiency as existing DP optimizers such as DP-SGD, DP-Adam, and DP-LAMB, but without the need for any DP-specific hyperparameters. In fact, automatic clipping uses a kind of normalization to bound the sensitivity of individual gradient. Additionally, they provide a thorough convergence analysis for DP-SGD with automatic clipping in the non-convex setting, demonstrating that it can match the convergence rate of standard SGD under certain conditions. The authors validate their proposal by showing that automatic clipping either matches or surpasses the state-of-the-art performance on a variety of language and vision tasks.\n"
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. **Simplicity**: The proposed method of automatic clipping significantly simplifies the process of DP training by eliminating the need for tuning DP-specific hyperparameters, thereby making DP as user-friendly as standard non-private training.\n\n2. **Performance**: The paper demonstrates that the automatic clipping method is either on par with, or better than, existing state-of-the-art techniques in a variety of tasks. This suggests that the method does not compromise performance for ease-of-use.\n\n3. **Rigorous Analysis**: The authors provide a detailed convergence analysis of automatic DP-SGD in a non-convex setting, showing that it can match the convergence rate of standard SGD under the symmetric gradient noise assumption of per-sample gradients."
      },
      "weaknesses": {
        "value": "**Misleading justification**: In figure 2, the paper present the dot products of $\\langle g_i, \\sum_i g_i \\rangle$. First it does not make sense if the dot product is properly normalized.  Moreover, the distribution of  $\\langle g_i, \\sum_i g_i \\rangle$ does not necessarily align with good performance. The illustration in Figure 2 is rather misleading.\n\n**Too strong Assumptions**: The proposed automatic clipping method's performance is based on a symmetric gradient noise assumption of the per-sample gradients. This assumption is too constrained and does not satisfy in practice.\n\n**Overclaim**: Section title 4.3 \"Automatic clipping is equally private and maximizes utility\" is somewhat overclaiming. It is not carefully argued why automatic clipping can \"maximize utility given a privacy budget.\n\n**Missing reference**: The paper missed a very related reference Yang et al. \"Normalized/clipped sgd with perturbation for differentially private non-convex optimization\" which also studied the DP-SGD with normalization. The paper should have a careful comparison with it."
      },
      "questions": {
        "value": "See weakness."
      },
      "limitations": {
        "value": "See weakness"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "4: Borderline reject: Technically solid paper where reasons to reject, e.g., limited evaluation, outweigh reasons to accept, e.g., good evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper discusses a way to control the sensitivity of DP-SGD by a method that does not require clipping.\n"
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "4 excellent"
      },
      "strengths": {
        "value": "- The motivation for the paper is clear\n- The authors make a compeling argument that suggest why their method should work\n- They have sound theoretical guarantees and experiments\n- The idea is simple yet fully developed\n- The impact this could have on private learning is huge\n- Experimental results are compeling\n"
      },
      "weaknesses": {
        "value": "N/A"
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "8: Strong Accept: Technically strong paper, with novel ideas, excellent impact on at least one area, or high-to-excellent impact on multiple areas, with excellent evaluation, resources, and reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The author(s) proposed a new gradient clipping technique for differential private training algorithms. It was shown that the new clipping technique is more robust to hyper-parameters and can save the time for hyper-parameter tunning. Convergence of the proposed method under a gradient symmetric assumption is developed and experiments on both vision and language tasks are conducted to evaluate the proposed method."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "- The paper is well-written and easy to follow in general.\n- The experiments are thorough and the algorithm seems to be useful on the practical side."
      },
      "weaknesses": {
        "value": "- The convergence analysis is based on a gradient symmetric assumption, therefore the utility bound in Theorem 4 is not really comparable to prior works. Please also see my quetions below. Overall, the theoretical contribution seems limited. However, given the strong empirical performance of the proposed method, this might be acceptable.\n- Some related work should be added [1,2,3].\n\n[1] Clip21: Error Feedback for Gradient Clipping, https://arxiv.org/abs/2305.18929\n\n[2] Improved Convergence of Differential Private SGD with Gradient Clipping, https://openreview.net/forum?id=FRLswckPXQ5\n\n[3] Normalized/Clipped SGD with Perturbation for Differentially Private Non-Convex Optimization, https://arxiv.org/pdf/2206.13033.pdf"
      },
      "questions": {
        "value": "- Consider the example with 3 data points, $f(x) = f_1(x) + f_2 (x) + f_3(x)$, where $f_1( x ) = 2 x^2, f_2(x) = (x-1)^2, f_3( x ) = f_2(x) = (x-1)^2$. Then the solution is at $x^* = 0.5$, but this point is not stationary for Algorithm 1, because $g_1( x^* ) = 2, g_2(x^*)=g_3(x^*)=-1$, which implies $g_1( x^* ) / \\| g_1( x^* ) \\| = 1, g_2(x^*) / g_2( x^* )=g_3(x^*)/g_3( x^* )=1$. Algorithm 1 willi fail on this example, does the author(s) agree?"
      },
      "limitations": {
        "value": "I do not find any negative societal impact of this paper."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper proposes a new alternative version of the DP-SGD algorithm where the gradients are normalized. This new method allows for a proof of convergence of the gradient when we add a small stability constant to the rescaling factor. This work eliminates the need for a costly 2D gridsearch between learning rate and clipping constant when training DP models. The authors then proceed to run experiments on to show their method equals or outperforms Abadi’s DP-SGD algorithm."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "The article eliminates a costly operation in DP training and provides strong evidence regarding the convergence of their method. The exhaustive list of datasets on which the method was tested testifies as to how only minimal changes to existing implementations are needed to apply this method.\n\n### Originality\n\nThe method is original.\n\n### Quality\n\nThe experiments presented are very complete and yield high quality results. Also, various supporting githubs and ressources are mentionned, making these results reproducible.\n\n### Clarity\n\nThe article is clear and well written.\n\n### Significance\n\nThe original motivation of the article is clear. "
      },
      "weaknesses": {
        "value": "## Sensitivity of the hyperparameter optimization\n\nThe results are not clear enough to indicate whether the proposed DP training method is superior to the rescaled DP-SGD method which impedes the significance of the article. If the authors of the paper manage to prove that their method is less expensive than the rescaled DP-SGD trick then the contribution is significant. The article lacks a conclusive experiment or statement proving that the sensitivity of the hyperparameter optimization process is easier with this method than with the re-scaled version of Abadi’s DP-SGD. \n\nThe paper shows in its appendix H. that the training process of the AUTO-S method is relatively robust to the choice of $\\gamma$ on NLP tasks. However the paper doesn’t compare the sensitivity of the **AUTO-S method** to the $\\gamma$ factor to the sensitivity of the **rescaled Abadi clipping** to the $R$ factor. In my opinion this is an important experiment to run, since it would justify using this method instead of the widely known rescaled DP-SGD version introduced in De et al. [15]. This could improve the impact and the significance of the contribution.\n\n### Actionable feedback\n\n> However, R remains and is expensive to tune (l223)\n\nThis sentence in particular is a bit of an overclaim in my opinion, see my comments below.\n\n**In your experiments you specifiy regarding the range of $\\gamma$**\n> ”under which a wide range of 0.0001 < < 1 gives similar accuracy”\n\nand\n>“Note that the largest good is 1000 times bigger than the smallest good ”\n\n\n**In the comparison to related works on clipping**\nYou state “Similarly (De et al.) re-parametrizes the per-sample gradient clipping to mimic normalization. However R remains and is expensive to tune (see figure 8 of De et al.)”. However this fig 8. shows that the re-parametrized per-sample gradient clipping seems to stay stable by a similar factor of approximately 1024 on the clipping norm, on a even harder dataset. Even though their experiment are not extensive enough to prove a superior efficiency of the rescaled DP-SGD method to yours, it is not conclusive enough for you to assume that your method is easier to tune.\n\nIf you add this missing experiment, or if you modify this claim, I would consider improving my rating."
      },
      "questions": {
        "value": "### Can you provide tangible proof that your method is significantly less expensive to tune than the rescaled DP-SGD algorithm ?\n\nThe figure you cite in the concurrent work of De et al. in section 4.4 does not seem complete enough and gives no indication of the strain in ressources the rescaled DP-SGD might still induce.\n"
      },
      "limitations": {
        "value": "The method is original. However some similarities can be drawn with existing concurrent approaches like Yang et al. 2022 [2206.13033]  that did not go through peer-reviewing to the best of my knowledge, however this work might be worth citing."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "A Theoretical Analysis of the Test Error of Finite-Rank Kernel Ridge Regression": [
    {
      "summary": {
        "value": "This paper gives a refined analysis of the test error of kernel ridge regression with a finite kernel in the underparametrized regime, where the rank M of the kernel is smaller than the number of data points N. The analysis improves upon previous ones by providing tighter non-asymptotic upper and lower bounds, which remain tight even as the ridge parameter goes to zero. When the target function lies in the RKHS, the bounds show that estimation is consistent as N goes to infinity."
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The paper is well written and clear. The authors state the contributions clearly and compare carefully with previous work. Establishing tight bounds for this basic learning setting is an important problem."
      },
      "weaknesses": {
        "value": "No major weaknesses, just some minor typos. I would also suggest that the authors include the explicit lower bounds in the main paper. Given that this a major focus of the paper it should not be required for the reader to go to the appendix. It would also be nice for the appendix to give a bit clearer account for the technical differences in the proof techniques of their bounds versus previous ones."
      },
      "questions": {
        "value": "- Can the authors elaborate the technical difficulties in extending beyond the finite rank setting, or even when M ~ N? Can analogous results be shown when the kernel is approximately low rank?\n\n- It is unclear that realistic NTK or random features will fall in this underparametrized regime. Can the authors give elaborate if this should be the case? Is it possible to experiment in more realistic NTK settings to truncate the kernel and apply the bounds?"
      },
      "limitations": {
        "value": "No limitations. Authors give some directions or future work."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper studies the kernel ridge regression under the non-asymptotic setting. The authors give the upper and lower bounds for bias and variance term, respectively. The authors argue the results improve upon those in Bach 2023."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "1 poor"
      },
      "strengths": {
        "value": "The paper is well-structured. The authors give rigorous proofs, following by careful experiments."
      },
      "weaknesses": {
        "value": "1. The paper requires further improvement and polishing in writing. To name a few, line 57-58; line 107-110.\n\n2. The paper would benefit from a more consistent and standardized use of symbols and notations. For example, in line 90, it would be better to use L_2(\\rho) instead of L_\\rho^2. In lien 92, the notation of \\tilde{f}(\\textbf{X}) is not proper. In Definition 3.1, it would be better to include the decreasing order of eigenvalues in the statement rather than adding an additional remark 3.2. In line 200-207, notation K^{(\\infty)}\n\n3. As mentioned in Bach 2023, more refined bounds can be found in Rudi et al. 2015, Rudi and Rosasco 2017. However, the authors failed to mention them and other related results in the comparison. In the absence of such comparisons, it is hard to tell the novelty and improvements of the current submission.\n\n4. The dependency of \\lambda seems to be incorrect for the variance term.\n\n5. Given Corollary 4.3.1 in the submission, I cannot see significant improvements against those in Bach 2023. Also, the authors did not give a proper explanation for considering \\lambda goes to 0."
      },
      "questions": {
        "value": "Could the authors mention the lower bound for the problem? \n\nWith optimal choice of \\lambda, we can derive the optimal upper bound for the test error. However, the current result does not show a bias-variance tradeoff with respect to \\lambda. Could the authors explain?"
      },
      "limitations": {
        "value": "No."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "4: Borderline reject: Technically solid paper where reasons to reject, e.g., limited evaluation, outweigh reasons to accept, e.g., good evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper analyzes the test error of ridge regression with a finite rank kernel. The finite rank kernel appears in several practical settings such as transfer learning and random neural networks. The authors provide a new analysis in this setting using tools from random matrix theory. A detailed comparison to other generalization bounds is presented."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. New generalization results in a practical and challenging setting.\n2. New analysis techniques.\n"
      },
      "weaknesses": {
        "value": "1. The comparison to standard generalization results is not clear (Eq. (12)). Both bounds scale as $\\sqrt{\\frac{\\log(n)}{n}}$. It is not clear which one is tighter.\n2. The technical details of the proof are not given and the novelty of the analysis is not explained in detail. Instead, most of the paper is devoted to a discussion and experiments.\n3. There are some unclear technical issues (see questions below).\n"
      },
      "questions": {
        "value": "1. The bound in Theorem 4.1 and the bound in Eq. (12) both scale as $\\sqrt{\\frac{\\log(n)}{n}}$. Which one is tighter and why? What is C in Eq. (12)?\n2. The test error definition is not standard: Shouldn’t the label be $y$ in the MSE and not $\\tilde{f}$? Is the definition of the test error the same in other works? Also, the bias-variance decomposition does not seem to be standard. Usually the learned predictor is the same in the bias expression (e.g., see the Wikipedia definition of bias-variance decomposition), whereas here the predictor is different: it changes from $f_{Z,\\lambda}$ to $f_{(X,f(X)),\\lambda)}$. Is this standard for analyzing kernel methods?\n3. Where in the analysis is the under-parameterized assumption ($M <N$) needed?\n4. In Eq. (10) if $\\tilde{\\gamma}_{>M} = 0$, the bias is exactly zero for all $N$? Is this a mistake?\n\n"
      },
      "limitations": {
        "value": "Limitations are not discussed in detail. Some of the limitations are mentioned throughout the paper. Maybe it will be helpful to add a limitations section and summarize all limitations."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper highlights the inadequacy of existing statistical learning guarantees for general kernel regressors when applied to finite-rank kernels. The authors have addressed this issue by developing non-asymptotic upper and lower bounds for the test error of finite-rank kernel ridge regression. These new bounds are more precise than the previously established ones and are applicable for any regularization parameters. This research provides a more dependable framework for utilizing finite-rank kernels in machine learning applications."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. The paper addresses an important gap in the current understanding of machine learning algorithms by developing more accurate and reliable bounds for finite-rank kernel ridge regression, which is frequently used in practical applications.\n\n2. The research provides a more precise and dependable framework for using finite-rank kernels in machine learning problems, which could result in better performance and more efficient algorithms."
      },
      "weaknesses": {
        "value": "1. The paper only considers under-parameterized regime.\n\n2. Low bound is a main argument of this paper, but all details are given in the Appendix.\n"
      },
      "questions": {
        "value": "1. It looks a little bit weird that you don't need to take $\\lambda=O(N^\\theta)$ for some $\\theta<0$ to balance the bias and variance. Any insights for this?\n\n2. In Theorem 4.1 and Corollary 4.3.1, what are the mild conditions on the kernel K? I cannot find the mild condition on input distribution either."
      },
      "limitations": {
        "value": "The authors have adequately addressed the limitations."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The authors address the problem of kernel ridge regression with a finite rank kernel, in the under-paramatrized regime. They prove sharper upper bounds on the test error, compared to previous existing works."
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "The discussion is very well-written and easy to follow, with a number of illustrations being provided to set up the problem. Careful and detailed comparison to previous work is given, making it easy to understand the novelty of the present manuscript. Overall, the addressed problem is an important one, and I believe the derived bound will be of interest to the community. I have not checked the proof, and therefore give a low confidence score."
      },
      "weaknesses": {
        "value": "I do not have any major concern. A minor remark is that while all experimental details are provided in Appendix D, it would be good to add at least a short description of the target functions and regularization used in Fig.1 and 2 in the main text or in the corresponding captions."
      },
      "questions": {
        "value": "- (minor) While the comparison with the bound of [6] in Fig. 2 is compelling, is there a reason why the bound of [30] is not also plotted? Its addition, or a brief sentence justifying its non-inclusion, would be welcome."
      },
      "limitations": {
        "value": "N/A"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "Comparing Optimization Targets for Contrast-Consistent Search": [],
  "Fine-Tuning Language Models with Just Forward Passes": [
    {
      "summary": {
        "value": "This work introduced a memory-efficient zeroth-order optimizer that can fine-tune large language models with the same memory footprint as inference, using only forward passes and gradient estimates. Comprehensive experiments across model types, scales, and tasks, showing that MeZO outperforms zero-shot, in-context learning, and linear probing, and achieves comparable performance to fine-tuning with backpropagation, while reducing memory cost by up to 12 times. Non-differentiable objectives that MeZO can optimize, such as accuracy or F1 score, which are usually not amenable to backpropagation. Theoretical insights that explain why MeZO can optimize LMs with billions of parameters, despite classical zeroth-order analyses suggesting otherwise.\n"
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. It proposes a novel and memory-efficient method to fine-tune large language models without backpropagation, which can save up to 12x memory compared to standard methods.\n\n2. It demonstrates that the proposed method can achieve comparable or superior performance to fine-tuning with backpropagation across various tasks, models, and tuning techniques.\n\n3. It shows that the proposed method can optimize non-differentiable objectives, such as accuracy or F1 score, which are useful for many applications.\n\n4. It provides theoretical insights on why the proposed method can overcome the classical limitations of zeroth-order optimization and leverage the benefits of pre-training and task prompts.\n"
      },
      "weaknesses": {
        "value": "1. While the experiments demonstrate good performance on the language understanding tasks, it is unknown whether the method is also applicable to the generation tasks.\n\n2. It relies on the assumption of low effective rank of the Hessian matrix, which may not hold for all loss functions. It would be great to have a discussion about the scope of application for the proposed method.\n"
      },
      "questions": {
        "value": "How is the training stability of MeZO? Does it an advantage over the backpropagation-based methods, especially for the large models?"
      },
      "limitations": {
        "value": "1. It would be better to have the experiment results on the generation tasks, e.g. translation and summarization.\n\n2. I suggest the authors to have a discussion about the scope of application for the proposed method."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "8: Strong Accept: Technically strong paper, with novel ideas, excellent impact on at least one area, or high-to-excellent impact on multiple areas, with excellent evaluation, resources, and reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper proposes an enhanced memory efficient zero-order optimization method named MeZO. MeZO only requires the same memory as inference time and thus can enable model tuning for large LMs with limited memory budget. The authors demonstrate the efficacy of MeZO on multiple NLP benchmarks compared with linear probing, in context learning and fine-tuning in few/low shot learning regime. The authors also provided detailed theoretical proof for MeZO. "
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "4 excellent"
      },
      "strengths": {
        "value": "0 - The authors targeted a not well understood domain (zero order optimization) and open up new opportunities for future works. In the era of LLMs, this method can enable many future work especially for those who don't have access to large-scale GPU clusters. \n1 - Comprehensive experiments and ablation studies on the proposed method.\n2 - Strong theoretical support on the proposed method.\n3 - Good writing and flow which makes the paper easy to follow and understand. \n4 - Well-articulated future work."
      },
      "weaknesses": {
        "value": "No major weaknesses. I left some comments in the questions section and hope  the authors can answer and address. "
      },
      "questions": {
        "value": "- Can authors also report practical training time compared with standard fine-tuning (e.g., in terms of # steps/ second)?\n\n- Maybe report average numbers as well in experiment results (e.g., Table 1)\n\n- Interested to see how the performance of MeZO compares with fine-tuning in the scenario of full training data (rather than k = 100, 500, etc). "
      },
      "limitations": {
        "value": "The authors have discussed limitations in the conclusion section and aim to explore them in future work."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "8: Strong Accept: Technically strong paper, with novel ideas, excellent impact on at least one area, or high-to-excellent impact on multiple areas, with excellent evaluation, resources, and reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper present a new optimiser MeZo based on stochastic approximation using gradient perturbation. \nThis optimiser is very memory efficient as it only requires to perform 2 forward passes with different deltas/epsilons on the parameters and multiple gaussian samplings.   These algorithms allows \"finetunning\" large language models to specific tasks very efficiently ( up to 30B on a single A100) yielding between x4 to x12 memory reductions. Since the proposed algorithm is an optimizer it can be combined with other standard techniques such as LORA or prefix tunning. All this is applied in finetunning setups similar to ICL. "
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "4 excellent"
      },
      "strengths": {
        "value": "The algorithm is a new application of well known stochastic gradient approximation but many times forgotten due to their slowness. \nIt is very surprising that this algorithm works, and the authors provide a theoretical justification of why this could be working in this case. \nThey also acknowledge that despite of what it might sound this approach only works in prompting fine-tunning scenario [Appendix B.2]. \n\nThe results are insight full , the baselines are fair and the theoretical analysis is correct to the best of my knowledge.\n\nThis can settle as an alternative to in context learning with prompting, by  fine-tuning with  a limited set of examples (512). \n\nThe proposed technique seems to work on the benchmarks used and seems to surpass other techniques such as Zero-shot, LP, ICL, and approaches very close performance to fine-tunning. This can be set a cheap alternative to ICL for some tasks.\n\n"
      },
      "weaknesses": {
        "value": "While there was a huge and titanic effort in the paper there were many questions that steam from the technique.\nThe first area which has not been explored too much and given as true is the need of having a prompt to apply MeZO.\nThis key ingredient is not well studied but rather given on some preliminary experiments, e.g. Table 5. \nWhy is MeZO not working w/o prompts, even some very simple prompts ? \n\nThe need of the prompt also raises the question of how this is related to ICL , as there are some works that suggest ICL maybe doing some alike to fine-tuning or back-propagation though the attention weights. Is this combination of prompting and MeZo that is guiding the forward propagations ? is there a mixed cooperation between the prompt and the stochastic technique ? How much of the prompt is needed ?\n\nAnother question would be how the different techniques behave as a function of the number of examples k. It would have been nice to see a plot for some models at least between ICL , MeZo, and possible ft on the selected tasks. Why have authors stopped at 512 ? why only 16 or 512 ? there are some dataset that contain more training examples. Why didn't they compare fine-tuning and MeZo in other setups with larger examples ?\n\nThere is the relationship between the task itself and the optimiser. It is not clear to me, in which tasks this will work properly. I suspect given the prompting above that this might only work on low-perplexity tasks or task in which prompting or ICL can generate good results and not in other more complex tasks. \n\nClearly this is maybe too much to address in the paper, but all aspects above point toward the little understanding the reader is left with on under which conditions this technique can be applied. The future work seems to already assume the MeZO algorithm is working and proved, but there is just an hypotheses and a very low link between the experiment conditions and the theory. The link is stablished as \"We attribute these phenomena to the Hessian of the loss exhibiting  small local effective rank.\" . It would have been nice to strengthen this connection with some experiments or computation. Could this explain when or how this algorithm is applied ? if we remove the prompt does this increases the H effective rank ? would other tasks exhibit larger ranks ?  how can we reduce it for each of the tasks ?\n\n\nPlease, I would kindly ask the authors to read above questions and discussion as a signal of the interest the paper brought to the research field and not as criticism on their very interesting work.\n"
      },
      "questions": {
        "value": "While I have many question none of them affect the paper directly. \nIt would be nice however if some of the weakness could be discussed by authors: \n* in which task will this technique work? do you have a characterisation ?  have you tried other tasks where it failed ? \n* why the Hessian hypotheses ? is this based on some experimental or preliminar analysis ?\n* when ft surpasses this techniques? when we have to ft on hundreds of thousands of examples ? \n* why it only works with prompting ? \n"
      },
      "limitations": {
        "value": "While the author do not focus on the limitations,  they are more or less clear per previous analysis. The focus of the paper is more on the direction of stressing the surprise of the technique with all known drawbacks is actually workig. "
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper proposes a new zeroth order optimizer, MeZO, for LM training.  This is proposed as an improvement to ZO-SGD.  The advantage of this approach is a 12x reduction in the amount of memory required for training compared to backpropagation.  This enables the training of much larger models.\n\nThe effectiveness of MeZO is shown across a range of benchmarks and model sizes.  The results compare favorably to linear probing and in context learning."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "4 excellent"
      },
      "strengths": {
        "value": "The MeZO technique stands to unlock substantial capability for LM training.  This enables training of much larger networks.  The compatibility with LoRA, prefix tuning are important use cases for many LM users.  There is an ability for optimizing non-differentiable objectives which is compelling, and could be expanded in the future.\n\nThe empirical behavior are coupled with a section on theory which effectively describes the both the expected behavior, but elaborates on the expected slow convergence by expanding the theoretical analysis to address low effective rank networks."
      },
      "weaknesses": {
        "value": "While the analysis refers to the convergence rate of MeZO, there is a very brief treatment of convergence behavior in the paper (Appendix E.2) It might be helpful for this to be expanded and possibly compared to backpropagation, especially in the context of the presentation of Section 4 Theory."
      },
      "questions": {
        "value": "Appendix A (and Section 3) demonstrate that promoting is crucial to MeZO performance.  Why is this? Much of the other behavior is supported by a theoretical treatment, but this observation stands out as relatively uninterrogated."
      },
      "limitations": {
        "value": "yes though fairly lightly.  The observation about prompts being critical for training may be a limitation for some (new) tasks or datasets."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "Fine-tuning with backpropogation becomes infeasible for very large language models because it uses too much memory. While zeroth-order optimization uses far less memory and could in principle fine-tune the model with just forward passes, past theory suggested that the learning rate must scale down with the number of parameters, making convergence prohibitively slow. However, this paper finds that zeroth-order optimization actually performs quite well and converges quickly even on very large language models. They provide theory to explain this fast convergence, where they show that under an assumption they call \"low effective rank,\" the learning rate scales down with the rank rather than the number of parameters. They also provide a memory-efficient implementation of zeroth-order optimization that they call MeZO, along with memory efficient zeroth-order versions of SGD with momentum and Adam. In experiments, the method performs similarly to backpropogation with 1/12 the memory usage, while outperforming in-context learning and linear probing."
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "4 excellent"
      },
      "strengths": {
        "value": "(1) The paper is well-written.\n\n(2) The method is simple and easy to understand.\n\n(3) The theory provides useful insights into why zeroth-order optimization works for fine-tuning large pre-trained models.\n\n(4) The experimental results are strong, and the appendix contains thorough ablations.\n\n(5) The idea that zeroth-order optimization works well for fine-tuning LMs seems practically useful and addresses a pressing need in the community for memory-efficient methods."
      },
      "weaknesses": {
        "value": "The paper seems strong overall, and I support its acceptance regardless of whether the suggested experiments below are run or not during the rebuttal period.\n\n(1) From what I understand, the paper does not verify the low effective rank assumption empirically, nor is it verified in the papers cited (which either study the effective rank / Hessian spectra in non-LLMs, or study the LLMs but not the effective rank and instead study the intrinsic dimensionality of fine-tuning). Therefore, to justify the assumption, it seems useful to study the Hessian spectra of the downstream fine-tuning loss in LLMs, at whatever size is feasible.\n\n(2) Related to (1), to verify the theory and confirm that the effective rank is indeed the quantity that determines convergence rates, it seems useful to run simulated experiments where one constructs a synthetic model + data and varies the effective rank, and examines whether the convergence rate or gradient norm scales with the effective rank as predicted in the theory."
      },
      "questions": {
        "value": "(1) While MeZO is much more memory efficient, is it slower than backprop in terms of wall-clock time? (The appendix does state that FT used 1K steps while MeZO used 100K steps in the experiments. How much faster is each step of MeZO compared to each step of backprop?)\n\n(2) It's a bit surprising to me that MeZO, MeZO-prefix, and MeZO-LoRA optimize at similar speeds (Figure 5 in the appendix). Do the backprop versions also optimize at similar speeds? And do the three parameterizations actually have similar effective ranks empirically?"
      },
      "limitations": {
        "value": "n/a"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "PIXIU: A Comprehensive Benchmark, Instruction Dataset and Large Language Model for Finance": [],
  "FLAb: Benchmarking deep learning methods for antibody fitness prediction": [],
  "Sparse Parameterization for Epitomic Dataset Distillation": [
    {
      "summary": {
        "value": "This paper proposes a new parameterization for dataset distillation. The new parameterization considers image patches, use sparse matrix and recurrent feature net to generate synthetic images. The total parameters follows storage constraint. The experimental results show improvement over previous methods."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "+ This paper proposes a new parameterization for synthetic images in Dataset Distillation. \n+ The proposed method works well across various benchmarks, including imagenet, cifar and cross arch generalization\n+ This paper is quite interesting in proceeding the research on Dataset Distillation parameters. Spatial redundancies are quite dominant in standard parameterization, and this method can certainly help with alleviating that."
      },
      "weaknesses": {
        "value": "- The paper claims on reducing spatial redundancies. I wonder how the authors compare their method with [19]. Does that also consider reducing spatial redundancies? \n- The paper provides better empirical performance, but the research messages are not quite surprising.\n- Have the authors considered using algorithms similar to [a] for sparsification?\n\n[a] Parameter-Efficient Transfer Learning with Diff Pruning"
      },
      "questions": {
        "value": "See weaknesses section."
      },
      "limitations": {
        "value": "Yes"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "5: Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This work proposes a new memory-saving method of dataset distillation by distilling the dataset into a set of Spatial-Agnostic Epitomic Tokens which are indexed by Sparse Coding Matrices and decoded into images by a Feature-Recurrent Network. This method is plug-and-play compatible with existing distillation methods, allowing them to achieve more efficient storage. State-of-the-art results are shown for many datasets and problem settings. "
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "4 excellent"
      },
      "strengths": {
        "value": "The overall presentation of the paper is very nice. The figures and equations very clearly explain to the reader the main ideas. The colorfully annotated Eq 7 especially makes the storage budget easy for the reader to digest. \n\nThe SPEED method itself is quite interesting, and algorithm 1 very clearly explains the process.\n\nThe many ablation studies and side-experiments further explain the effectiveness of the method."
      },
      "weaknesses": {
        "value": "The biggest issues I have with this paper are the presentation of tables 1 and 2.\n\nThis is not an issue specific to this paper, but methods that do re-paramaterization as a means of memory saving should not be directly compared to methods that only propose a matching algorithm.\n\nIt should be made extremely clear that IDC, HaBa, RTP and SPEED are solving an inherently different problem than the baseline methods.\n\nSynthetic set size should also not be given in \"IPC\" but in the number of learnable parameters, since the given IPC simply isn't true anymore. For example, instead of IPC=10, you could have #Params <= 30,720 (10x3x32x32)"
      },
      "questions": {
        "value": "I am happy to raise my score if the above weakness is addressed.\n\nI am also just curious about another thing:\n\nThe high resolution images seem extremely blocky due to the nature of the patches.\n\nHave you considered adding 1 or 2 convolutional layers _after_ the patches are stitched back together?"
      },
      "limitations": {
        "value": "yes"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The paper proposes a new framework(SPEED) to perform dataset distillation.\n\nThe new framework is composed of 3 parts:\n1. Spatial-Agnostic Epitomic Tokens (SAETs)\n2. Sparse Coding Matrices (SCMs)\n3.  A Feature-Recurrent Network (FReeNet)\n\nThe paper also employees multi-head attention to ensure the diversity of distilled images, thus achieving new SOTA. \nThe new framework SPEED is also claimed to work with multiple dataset matching methods and enhance their performances.\n\nThrough various experiments, the method shows strong performances on CIFAR-10/100 and TinyImageNet. Similar results are also observed on ImageNet subsets.\n\n### I have read the author's response and my concerns are addressed by seeing more experiment results."
      },
      "soundness": {
        "value": "2 fair"
      },
      "presentation": {
        "value": "2 fair"
      },
      "contribution": {
        "value": "2 fair"
      },
      "strengths": {
        "value": "## originality\nSPEED is claimed to be the first paper studying the spatial redundancy in the field of dataset distillation/condensation\n\nSPEED applies a few methods such as the concepts from ViT, dictionary learning and sparse coding.\n\n## quality\nThe method works very well on dataset with higher resolution.\n\n## clarity\nThe paper is well written and easy to follow\n\nThe framework of the method and learned images are visualized which makes it easy to understand.\n\n## significance\nThe proposed methods achieve SOTA performances under most settings.\n\nThe paper novelly proposes to distill images at image patch level which shows a new way for dataset distillation.\n\nThe proposed method is compatible with multiple matching objectives."
      },
      "weaknesses": {
        "value": "- Incomplete evaluation results in table 2. IPC 1/10/50 are used for CIFAR-10/100, but only IPC 1 for TinyImageNet is used. Why that is the case? From [1], even the trajectory matching method this paper adopts has reported the results on TinyImageNet with IPC 1/10/50.\n\n- In table 1, for the parameterization methods including SPEED, can the author include how many synthetic images are generated for evaluations, e.g. 11 for IPC 1 so that we know if the performance gain is due to increased number of images or increased quality of generated images.\n\n\n\n\n\n\n\n[1] Dataset Distillation by Matching Training Trajectories"
      },
      "questions": {
        "value": "See my comments in weakness section. On general, this paper provides some insights on a totally different way of parameterization in dataset distillation. I am willing to raise the score if the above questions are answered."
      },
      "limitations": {
        "value": "The paper proposes a new method to apply parameterization in dataset distillation. However, the generalization ability of the method is unknown such as the recurrent neural network. Especially some evaluation results in table 2 are missing which makes it even harder to tell."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper introduces the insight of sparse coding into dataset distillation and proposes a sound method. This work can efficiently generate syn data by adopting the multi-head SCMs as the shared source of the syn images and using a recurrent model to generate the syn patches. It can cooperate with various previous matching methods. In extensive experiments, the proposed method shows auspicious results and superiority."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "+ Importing the sparse coding into the syn data is interesting and effective from the experiments. The analysis of the problem of overlooking the syn data sparsity itself is insightful and naturally leads to the proposed method.\n\n+ Good writing, easy to follow.\n\n+ Extensive experiments, ablations, and visualizations.\n\n+ Insightful and valuable discussions and analyses, especially the syn data property, clear formulation, storage analysis, and trade-off between quality and quantity.\n\n+ Fig III in the appendix clearly showcases the effects of the proposed method."
      },
      "weaknesses": {
        "value": "- More discussions about the relations between dataset distillation, sparse coding, and corset selection.\n\n- Though the recurrent model is sound according to the cost discussion. I still wonder about the performance of adopting a heavier model following the same idea of the proposed method.\n\n- Fig. 4: should be more self-contained, please explain the comparison and differences/similarities."
      },
      "questions": {
        "value": "1. If the image size is larger, what will happen?\n\n2. Some other possible choices of the SCM format and utilization? For future study."
      },
      "limitations": {
        "value": "Discussed."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "8: Strong Accept: Technically strong paper, with novel ideas, excellent impact on at least one area, or high-to-excellent impact on multiple areas, with excellent evaluation, resources, and reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ],
  "Truly Scale-Equivariant Deep Nets with Fourier Layers": [
    {
      "summary": {
        "value": "This paper proposes a formulation of scale equivariant networks, which takes anti-aliasing into account. This is in contrast to previous works, in which the issue of aliasing is often disregarded. The proposed method achieves competitive classification accuracy on MNIST-scale and STL-10, while maintaining zero equivariance error."
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "4 excellent"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "This work addresses a problem that has been thus far disregarded when talking about scale equivariance: the aliasing issue. The proposed methods and solutions are sound and are empirically evaluated with very good results."
      },
      "weaknesses": {
        "value": "* My main concern is that, to the best of my understanding, the proposed framework does not consider inter-scale relationships. Instead, it considers multiple scales in parallel which are processed independently of one another. This brings into question whether this work should be defined as a work in group equivariance or rather a work on models aiming to be resolution-agnostic, i.e., able to work regardless of the resolution of the input, e.g., FlexConv [1], S4ND[2], \\inf-Diffusion [3].\n\n* This method relies heavily on using the Fourier and inverse Fourier transform for each of its layers. In addition, it is well-known that performing convolutions on the spatial domain is faster and requires less memory than performing them in the Fourier domain when convolutional kernels are small O(Nk) vs O(NlogN). However, the proposed method actually relies on small convolutional kernels. These two factors call into question the computational and memory complexity of the proposed method. I believe that this is the main practical limitation of the method, and I would like the authors to discuss this in the paper –in case it is indeed an issue–.\n\n* Connecting to the previous point, I believe that having a section in which the limitations of the work are clearly stated and discussed is vital."
      },
      "questions": {
        "value": "* I find the definition of the convolutional kernels (Eq. 14) too convoluted. I would simply say that you define a kernel of size k in the spatial domain and send it to the Fourier domain next.\n\n* There are several works that tackle the issue of downsampling breaking equivariance (even in a general group setting) as well as tackling aliasing in many other settings, e.g.,[1,2,3,4,5,6,7] among many more. I believe that discussing these works would be beneficial to scope the paper better.\n\n* In line 213, you mention that you do the analysis of Sosnovik et al on trained models. Although I understand your reasoning, I actually believe that treating non-trained networks directly, i.e., random nets, makes more sense in order to evaluate the real capability of the networks to remove aliasing and preserve equivariance. Have you done this analysis as well? What were the results? Did you still get zero equivariance error?\n\n* I believe line 165 has an error.\n\n* The paper has some small typos. Please correct them.\n"
      },
      "limitations": {
        "value": "As mentioned previously, the authors have not listed any limitations of their work in the paper.\n\n### Conclusion\n\nIn conclusion, I think this is an interesting paper with important contributions to the field. However, I am not sure if this paper should be framed as a scale-equivariant paper or rather as a resolution-agnostic neural architecture. I believe –please do tell me if you don't agree– that the latter option is more accurate. Although it requires some rewriting, I believe it would be possible to still do this during the rebuttal period.\n\n#### References\n\n[1] Romero, D. W., Bruintjes, R. J., Tomczak, J. M., Bekkers, E. J., Hoogendoorn, M., & van Gemert, J. C. (2021). Flexconv: Continuous kernel convolutions with differentiable kernel sizes. arXiv preprint arXiv:2110.08059.\n\n[2]  Nguyen, Eric, Karan Goel, Albert Gu, Gordon Downs, Preey Shah, Tri Dao, Stephen Baccus, and Christopher Ré. \"S4nd: Modeling images and videos as multidimensional signals with state spaces.\" Advances in neural information processing systems 35 (2022): 2846-2861.\n\n[3] Bond-Taylor, S., & Willcocks, C. G. (2023). $\\infty $-Diff: Infinite Resolution Diffusion with Subsampled Mollified States. arXiv preprint arXiv:2303.18242.\n\n[4] Karras, Tero, Miika Aittala, Samuli Laine, Erik Härkönen, Janne Hellsten, Jaakko Lehtinen, and Timo Aila. \"Alias-free generative adversarial networks.\" Advances in Neural Information Processing Systems 34 (2021): 852-863.\n\n[5] Zhang, R., 2019, May. Making convolutional networks shift-invariant again. In International conference on machine learning (pp. 7324-7334). PMLR.\n\n[6] Xu, J., Kim, H., Rainforth, T. and Teh, Y., 2021. Group equivariant subsampling. Advances in Neural Information Processing Systems, 34, pp.5934-5946.\n\n[7] Rojas-Gomez, Renan A., Teck-Yian Lim, Alex Schwing, Minh Do, and Raymond A. Yeh. \"Learnable Polyphase Sampling for Shift Invariant and Equivariant Convolutional Networks.\" Advances in Neural Information Processing Systems 35 (2022): 35755-35768.\n"
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The submitted paper explores the problem of scale-equivariant neural networks.\nTo get the desired property by design, the authors propose new building blocks: a spatially local Fourier layer, a novel scale-equivariant pooling layer, and scale-equivariant way of applying activation functions.\nAll the introduced modifications rely heavily on the Fourier transform of the input feature map. \nAdditionally, a new loss function is proposed which aims to promote the natural consistency of predictions made at different scales. \n\nThe effect of the new approach is demonstrated on the problem of image classification on two datasets: MNIST-scale and STL-10-scale. "
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "I find the proposed modifications well explained and motivated. \nTo the best of my knowledge, the presented approach is original enough, and it may be interesting for the broad community. \nQuality of the results seems very satisfactory and I hope they can serve as a reliable baseline for further research on this topic. \n"
      },
      "weaknesses": {
        "value": "1. While the proposed results seem strong enough for the task of object recognition, the authors have not reported the computational or memory overhead introduced by their approach. Without this knowledge, it is hard to understand if their method can be directly scaled to more high-resolution data without any significant changes.\n\n1. I admit that most prior papers also mostly report their performance for image classification, it is quite clear that the property of scale equivariance may be even more desirable for the dense prediction tasks, e.g. semantic segmentation. Are there any barriers to applying the same method to the common segmentation architectures?\n\n1. Regarding the low performance of baseline models on STL-10-scale data (line 274), have the authors tried other padding schemes than zero-padding, e.g. so-called reflect/replicate/circular strategies (see the [link](https://pytorch.org/docs/stable/generated/torch.nn.functional.pad.html))? I find it suspicious that, e.g. the reported DISCO performance of 91.93% accuracy on STL-10 [1] drops to 47.68% on STL-10-scale (Tab. 4) in the provided evaluation results. I think, more discussion is needed on that matter.\n\n[1] Sosnovik et al. DISCO: accurate Discrete Scale Convolutions. In BMVC, 2021."
      },
      "questions": {
        "value": "Please, address the aforementioned weaknesses."
      },
      "limitations": {
        "value": "No additional inquiries."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "This paper introduces Truly Scale-Equivariant Deep Nets with Fourier Layers, which directly formulate down-scaling in the discrete domain to address the anti-aliasing problem. The proposed methods are validated on the MNIST-scale and STL-10 datasets, demonstrating good classification performance while preserving zero equivariance error."
      },
      "soundness": {
        "value": "3 good"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "1. This paper addresses how to learn scale-equivariant representations in deep neural networks, overcoming the limitation of previous methods that did not account for anti-aliasing.\n2. The paper proposes a method that can consider the down-scaling operation directly in the discrete domain with anti-aliasing and achieves good performance.\n"
      },
      "weaknesses": {
        "value": "1. This paper does not provide sufficient experiments to demonstrate the generality of the proposed method. It only tests on two small datasets and a single high-level vision task (image classification), which limits the impact of the proposed method. This paper should also evaluate the method on more larger-scale datasets, more high-level vision tasks (e.g., image segmentation), and more CNN architectures.\n2. Why does the baseline use zero-padding to the original resolution as the input, instead of resizing to the original resolution? Does this affect baseline's representation learning and performance?\n3. The paper lacks an analysis of the computational cost of the proposed method and other compared baseline during training and inference.\n"
      },
      "questions": {
        "value": "Please refer to the weakness part."
      },
      "limitations": {
        "value": "Not applicable."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "6: Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations."
      },
      "confidence": {
        "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    },
    {
      "summary": {
        "value": "The authors of this study introduce architectural modifications to the conventional CNN framework by incorporating Fourier layers. Their aim is to achieve scale-equivariance, addressing the anti-aliasing problem that occurs when images are downscaled in the continuous domain. To tackle this issue, the authors propose a discrete domain downsampling formulation and propose corresponding changes to the network architecture. Through experiments on a few datasets, the authors demonstrate that their method achieves zero scale-equivariance error."
      },
      "soundness": {
        "value": "4 excellent"
      },
      "presentation": {
        "value": "3 good"
      },
      "contribution": {
        "value": "3 good"
      },
      "strengths": {
        "value": "- The paper is well-written, precise, and easy to follow. In particular, their motivation is stated clearly, they introduce the preliminaries succinctly, and the approach stated is coherent and structured.\n\n- To the best of my knowledge the proposed method is novel and the claims that the module modifications achieve scale-equivariance is correct.\n\n- I am unaware of any method but this that solves the chosen problem completely, i.e achieves zero scale-equivariance error when downsampling is done via anti-aliasing and subsampling ('ideal' subsampling). The results are also competent when they do 'non-ideal' subsampling when compared to standard baselines. \n\n- The motivation that images of higher-scale should achieve better classification accuracy than the ones of lower scales is reasonable and the corresponding proposed constraint is sound.\n\nOverall I think the ideas presented in this paper maybe of interest to the broad ML community."
      },
      "weaknesses": {
        "value": "- Due to the complexity involved in the several DFT/Inverse-DFT related operations, the baselines they compare to which involve kernel resizing are certainly not as costly as the proposed method. I suggest the authors to discuss how their method compares to the baselines in terms of computational/time complexity.\n\n- For the same aforementioned reasons, I suspect that the method might not scale to high dimensional datasets like ImageNet or standard architectures like ResNet50. This I think would be a fundamental limitation, therefore I encourage the authors to discuss the challenges in scaling their method to the mentioned settings. I would be interested to know which modules will be particularly harder to scale.\n\n- Some minor text changes:\n\n     - Line 119, Claim 1: 'even lower in frequencies' needs to be 'even in lower frequencies.'\n\n     - Line 138, Claim 2: 'equivaraint' needs to be 'equivariant.'\n\n- Figure 1, Figtitle: “On the other hand, downsampling the high-res feature is guaranteed to achieve the same low-resolution feature.” -> Unclear formulation. It is not clear how the downsampled version of the features was achieved. The text suggests that it has merely been downsampled from the high-resolution version, but then it is not clear which role the new proposed architecture plays. Please rephrase for clarity.\n\n\n- Line 32: “Specifically, these works are derived using a continuous domain down-scaling operation, i.e., there is no need to consider anti-aliasing. However, when performing a down-scaling, the Nyquist theorem [21, 27] tells us that an anti-alias filter is necessary to avoid high-frequency content to alias into lower frequencies. (...) To address this gap, from prior work, we consider the down-scaling operation directly in the discrete domain taking into account of the anti-aliasing.” Several grammar errors and the paragraph is unclear to me. In the first sentence, the authors write that previous works “do not need to consider anti-aliasing”. But then, they aim to bridge the gap and take anti-aliasing into account. Please fix the formulation as it is currently very unclear whether previous works had an issue with anti-aliasing or not.\n\n\n- Line 103: The notation for the definition of g is unclear. It is unclear what is meant by that x is \\in {R^1, R^2 … R^N}, which makes it hard to understand the following definitions. The notation of {..} suggests that x can be from R^1, but then how is the Fourier transform of one number even defined? The Fourier transform is needed for D_R(x). I am confused by this definition, please rewrite for clarity. \n\n\n- It would be helpful if the authors would state that small x refers to the spatial domain and big X always refers to the Fourier domain. While this is the common practice, it would still be nice to state it explicitly.\n\n\n- I don’t understand Fig. 2b. Are the yellow regions ones and the gray ones zero?\n\n\n- Line 142: “Element-wise non-linearities, e.g., ReLU, in the spatial domain are generally not scale-equivariant under the ideal downsampling operation DR.” The reasoning of this claim is not obvious to me, please explain / give some intuition.\n\n\n"
      },
      "questions": {
        "value": "I encourage the authors to respond to the points I raised on weaknesses and fix minor text errors. I am willing to raise my score if the authors adequately respond to my concerns."
      },
      "limitations": {
        "value": "The authors have not included a Broader Impact section and did not discuss the potential negative societal impact of their work. They also do not have a discussion section where some limitations of their work could have been discussed."
      },
      "flag_for_ethics_review": {
        "value": [
          "No ethics review needed."
        ]
      },
      "rating": {
        "value": "7: Accept: Technically solid paper, with high impact on at least one sub-area, or moderate-to-high impact on more than one areas, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations."
      },
      "confidence": {
        "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
      },
      "code_of_conduct": {
        "value": "Yes"
      }
    }
  ]
}